% rebase('layout.tpl', title="Mnemonistka")

<!-- Begin page content -->
<main role="main" class="flex-shrink-0">
  <div class="container">


    <h1 class="mt-5">Теория</h1>
    <p class="lead">Здесь Вы сможете ознакомиться с упражнениями по тренировке внимания и мышления.</p>

<div class="row">
	<div class="col-md-6" style="border: 5px solid; margin: 15px; padding: 10px; background-color: rgba(150, 200, 200, 0.4)">
		<strong>Упражнение «Буквы»</strong>. Возьмите газету или журнал, выберите для упражнения три-четыре абзаца. Читайте статью и подсчитывайте в ней количество букв «а». Затем прочитайте еще раз и подсчитайте количество букв «в». Прочитайте статью снова и зафиксируйте количество слов в выбранном вами отрывке. Результат запишите. Упражняйтесь с одним текстом, пока количество подсчитанных вами букв не перестанет меняться. Упражнение можно выполнять произвольно, подсчитывая любые буквы и используя для этого любой текст. Очень хорошо дополнительно фиксировать время выполнения упражнения по секундомеру. Тогда вы сможете сравнить свои результаты по времени выполнения упражнения и по количеству ошибок (пропусков).
	</div>
	<div class="col-md-5" style="border: 5px solid; margin: 15px; padding: 10px; background-color: rgba(150, 200, 200, 0.4)">
		<strong>Упражнение «Активизация памяти»</strong>. Как можно подробнее вспомните свой вчерашний день, недавно просмотренный фильм, свой летний отдых. Главное в этом упражнении - удерживать внимание на процессе припоминания достаточно длительное время (5-10 минут), не допуская перескакивания мысли на другие темы. Вспоминайте как можно подробнее, все мелочи. Продвигайтесь по воспоминанию медленно, шаг за шагом. Если вам это удается очень легко, попробуйте вспоминать все наоборот, поверните время вспять. Упражнение сильно усложнится.
	</div>

	<div class="col-md-4" style="border: 5px solid; margin: 15px; padding: 10px; background-color: rgba(150, 200, 200, 0.4)">
		<strong>Упражнение «Мысленная прорисовка».</strong> Рисуйте перед своим мысленным взором буквы, числа, простые и сложные геометрические фигуры. Не путайте мысленную прорисовку с обычным представлением какого-либо образа. В этом упражнении необходимо именно «рисовать» - так, как будто вы рисуете фломастером на листе, пальцем на пыльной поверхности или кистью на стене. Постарайтесь рисовать крупнее. При этом ощутите движение своей руки, которая должна быть неподвижна.
	</div>
	<div class="col-md-6" style="border: 5px solid; margin: 15px; padding: 10px; background-color: rgba(150, 200, 200, 0.4)">
		<strong>Упражнение «Манипулирование образами».</strong> Представьте мысленно стакан и рядом с ним коробок спичек. Постарайтесь как можно четче увидеть эти образы. Проделывайте с представляемыми предметами самые разнообразные манипуляции. Перемещайте и совмещайте их (коробок в стакане, стакан на коробке, коробок на перевернутом стакане и т.д.) Манипулируйте в уме другими предметами (двумя, тремя, четырьмя).
	</div>
	<div class="col-md-2" style="border: 5px solid; margin: 15px; padding: 10px; background-color: rgba(150, 200, 200, 0.4)">
		<strong>Упражнение «Трансформация образов».</strong> Представьте себе какойлибо предмет и изменяйте его, но чтобы он при этом не терял своего видового названия (чашка при любых ваших изменениях всегда должна оставаться чашкой).
	</div>
	<div class="col-md-6" style="border: 5px solid; margin: 15px; background-color: rgba(150, 200, 200, 0.4)">
		<strong>Упражнение «Вращение образов».</strong> Представьте образ и вращайте его мысленно, рассматривая с разных сторон, под разными углами, приближая и удаляя от себя. Постарайтесь сделать так, чтобы образ вращался сам, а вы только лишь наблюдали бы за его вращением.
	</div>
	<div class="col-md-3" style="border: 5px solid; margin: 15px; padding: 10px; background-color: rgba(150, 200, 200, 0.4)">
		<strong> Как повторять? </strong>
		<ol>
		<li>Первое мысленное повторение делайте сразу после запоминания.</li>
   		<li>Второе повторение - примерно через 40-60 минут.</li>
   		<li>Третье - в этот же день (примерно через 3-4 часа).</li>
   		<li>Четвертое мысленное повторение - на следующий день.</li>
   		</ol>
	</div>

</div>

    
  </div>
</main>